# GetRoofPrefStyle

## Description
Gets the Roof Style of the Roof Preferences.

```pascal
FUNCTION GetRoofPrefStyle : LONGINT;
```

```python
def vs.GetRoofPrefStyle():
    return LONGINT
```

## Examples
```pascal
resultN := GetRoofPrefStyle;
```
```python
import vs

# Gets the Roof Style of the Roof Preferences.
resultN = vs.GetRoofPrefStyle()
vs.Message('GetRoofPrefStyle returned: ' + str(resultN))
```

## See Also
VS Functions:
SetRoofPrefStyle

## Version
Availability: from Vectorworks 2016

## Category
* Objects - Architectural